mock-example/src/test/resources/xml/AMRLiRT/CalculateLGD/rq2.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"  xmlns:amr="http://sbrf.ru/NCP/AMRLIRT/" xmlns:cal="http://sbrf.ru/NCP/AMRLIRT/CalculateLGDRq/">
  <soap:Header/>
  <soap:Body>
    <amr:calculateLGDRq>
      <cal:comments>testError</cal:comments>
</amr:calculateLGDRq>
  </soap:Body>
</soap:Envelope>